papers/tac-15-privacy.html
---
comments: true
layout: page
title: Privacy Preserving Average Consensus
---
<hr>
<p>
<b>Yilin Mo and Richard M. Murray</b>
</p>

<p>
<i>IEEE Transactions on Automatic Control</i>, Accepted
</p>

<p>
Link to the <a href="../../../public/papers/tac2014privacy.pdf">paper</a>
</p>

<p>
If you want to leave any comments, you can annotate the <a href="../../../pdfviewer/viewer/web/viewer.html?file=%2Fpublic%2Fpapers%2Ftac2014privacy.pdf">pdf</a>. I will try to be responsive. You can also annotate this page or leave comments below. 
</p>

<div id="outline-container-org8bbf437" class="outline-2">
<h2 id="org8bbf437">Abstract</h2>
<div class="outline-text-2" id="text-org8bbf437">
<p>
Average consensus is a widely used algorithm for distributed computing and control, where all the agents in the network constantly communicate and update their states in order to achieve an agreement. This approach could result in an undesirable disclosure of information on the initial state of an agent to the other agents. In this paper, we propose a privacy preserving average consensus algorithm to guarantee the privacy of the initial state and asymptotic consensus on the exact average of the initial values, by adding and subtracting random noises to the consensus process. We characterize the mean square convergence rate of our consensus algorithm and derive the covariance matrix of the maximum likelihood estimate on the initial state. Moreover, we prove that our proposed algorithm is optimal in the sense that it does not disclose any information more than necessary to achieve the average consensus. A numerical example is provided to illustrate the effectiveness of the proposed design.
</p>
</div>
</div>

<div id="outline-container-org4e2fcc9" class="outline-2">
<h2 id="org4e2fcc9">Acknowledgement</h2>
<div class="outline-text-2" id="text-org4e2fcc9">
<p>
The authors would like to thank Tianyi Bai(tbai@clipper.ens.fr) and Guoda Tian for carefully proofreading the paper.
</p>
</div>
</div>
